blog/example-dockerfile-for-non-root-application.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-22 Wed 14:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Example Dockerfile for non-root application</title>
<meta name="author" content="Siqing Mu" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Example Dockerfile for non-root application</h1>
<p>
The following example is a Dockerfile that runs an application as a non-root user with non-group membership. 
</p>


<p>
Dockerfile
</p>
<pre class="example" id="org77d236a">
FROM ubuntu:latest
 
#Update and install the make utility
RUN apt update &amp;&amp; apt install -y make
 
#Copy the source from a folder called “code” and build the application with the make utility
COPY . /code
RUN make /code
 
#Create a new user (user1) and new group (group1); then switch into that user’s context
RUN useradd user1 &amp;&amp; groupadd group1
USER user1:group1
 
#Set the default entrypoint for the container
CMD /code/app
</pre>

<p>
Reference:
</p>
<ul class="org-ul">
<li><a href="https://media.defense.gov/2021/Aug/03/2002820425/-1/-1/1/CTR_KUBERNETES%20HARDENING%20GUIDANCE.PDF">https://media.defense.gov/2021/Aug/03/2002820425/-1/-1/1/CTR_KUBERNETES%20HARDENING%20GUIDANCE.PDF</a></li>
</ul>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>
